---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.SpiralRunRadiusTooSmallFailure
source: html/fdad07eb-0668-cf65-2e47-1b8a30fbd3a1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.SpiralRunRadiusTooSmallFailure Property

The radius value for the run is too small.

## Syntax (C#)
```csharp
public static FailureDefinitionId SpiralRunRadiusTooSmallFailure { get; }
```